//
//  ZYTeacher.m
//  07-模版模式
//
//  Created by zy on 2017/7/13.
//  Copyright © 2017年 zy. All rights reserved.
//

#import "ZYTeacher.h"

@implementation ZYTeacher

-(void)questionA{
    
    NSLog(@"\nquestionA\n 1．下列各句中，没有错别字且加点字的注音全都正确的一项是（3分）\n A．风靡（mí）各大城市的共享单车给大众出行带来了便利，但乱停乱放，妨碍交通，成为城市“烂疮（chuāng）疤”，则与共享的初衷背道而驰。\n B．某某快递公司陷入“自噬（shì）”的困境，背后是快速扩张带来的后遗症；加盟模式曾是其业绩突飞猛进的密诀，但也是动摇其大厦基石的蚁穴（xué）。\n C．近日，《我是范雨素》一文在网上刷屏，开篇一句“我的生命是一本不忍卒（zú）读的书，命运把我装订得极为拙劣”，便让很多人不禁（jìn）潸然泪下。\n D．作为一部主旋律片，《湄公河行动》真实再现了那场发生在金三角的缉（jī）毒战役，片中抓捕过程之惊险，战斗场面之惨烈，令人咋zé）舌。");
    [self answerA];
}

-(void)questionB{
    
    NSLog(@"\nquestionB\n 下列各句中，没有语病的一项是（3分）\n A．国产大飞机C919首飞成功后，各参研参试单位纷纷表示，要发奋努力把大型客机打造成建设创新型国家和制造强国的标志性工程。\n B．《朗读者》开播后，许多广电名嘴、企业职工、机关干部、退休教师、留学生吟诵社等朗诵爱好者，纷纷加入文化经典诵读的行列。\n C．“大众创业、万众创新”活动发展势头迅猛：无论是在大学校园，还是在产业园区，抑或是在街道社区，各类创业创新赛事如火如荼。\n D．桃花乡走可持续发展之路，按照建成生态环境和谐优美、资源集约节约利用、经济社会协调发展的生态乡，制订了五年发展建设规划");
    [self answerB];
}

-(void)answerA{
    
}

-(void)answerB{
    
}


@end

